<a href="https://colab.research.google.com/github/mohamednader973/Pandas_python/blob/main/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**pandas**

loading csv files

In [4]:
import pandas as pd
csv_path='sample_data/california_housing_test.csv'
df=pd.read_csv(csv_path)
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

loading excel sheets

In [6]:
csv_path1='data.xlsx'
df1=pd.read_excel(csv_path1)
df1.head()

   number                 name  age  grade  gender
0       1  mohamed karim samir   12   0.88    male
1       2     ahmed essam omar   20   0.90    male
2       3   sarah hesham ahmed   30   0.56  female
3       4    lara mamoun ahmed   22   0.42  female
4       5     leila ahmed amir   10   1.00  female

creating a data frame

In [20]:
songs={'albums':['thriller','back in black','the dark side of the moon','the bodyguard','bat out of hell'],'released':[1982,1980,1973,1992,1977],'length':['00:42:19','00:42:11','00:42:49','00:57:44','00:46:33']}
songs_dataframe=pd.DataFrame(songs)
songs_dataframe.head()

                      albums  released    length
0                   thriller      1982  00:42:19
1              back in black      1980  00:42:11
2  the dark side of the moon      1973  00:42:49
3              the bodyguard      1992  00:57:44
4            bat out of hell      1977  00:46:33

In [14]:
songs_dataframe[['length']]

     length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33

In [13]:
songs_dataframe[['albums','released']]

                      albums  released
0                   thriller      1982
1              back in black      1980
2  the dark side of the moon      1973
3              the bodyguard      1992
4            bat out of hell      1977

Dataframes slicing

In [26]:
songs_dataframe.loc[0,'albums']

'thriller'

In [28]:
songs_dataframe.loc[0:2,'albums':]

                      albums  released    length
0                   thriller      1982  00:42:19
1              back in black      1980  00:42:11
2  the dark side of the moon      1973  00:42:49

In [30]:
index=['row1','row2','row3','row4','row5']
songs_dataframe.index=index
songs_dataframe

                         albums  released    length
row1                   thriller      1982  00:42:19
row2              back in black      1980  00:42:11
row3  the dark side of the moon      1973  00:42:49
row4              the bodyguard      1992  00:57:44
row5            bat out of hell      1977  00:46:33

working with and saving data in pandas

In [32]:
csv_path2='sample_data/california_housing_train.csv'
df2=pd.read_csv(csv_path2)
df2

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [39]:
df3=df2[df2['latitude']>41.8]
df3

       longitude  latitude  ...  median_income  median_house_value
10620    -120.48     41.82  ...         2.0227             47500.0
13341    -121.93     41.86  ...         1.7400             44000.0
15516    -122.33     41.86  ...         2.2340             58600.0
16361    -122.53     41.81  ...         1.7639             55400.0
16497    -122.64     41.95  ...         1.8242             53500.0
16833    -123.26     41.86  ...         2.7222             64600.0
16883    -123.83     41.88  ...         3.1300            116700.0
16939    -124.14     41.95  ...         2.2750            122400.0
16949    -124.15     41.81  ...         2.2868            103100.0
16997    -124.30     41.84  ...         3.0313            103600.0

[10 rows x 9 columns]

save as csv

In [ ]:
df3.to_csv('newdf.csv')

In [40]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 10620 to 16997
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           10 non-null     float64
 1   latitude            10 non-null     float64
 2   housing_median_age  10 non-null     float64
 3   total_rooms         10 non-null     float64
 4   total_bedrooms      10 non-null     float64
 5   population          10 non-null     float64
 6   households          10 non-null     float64
 7   median_income       10 non-null     float64
 8   median_house_value  10 non-null     float64
dtypes: float64(9)
memory usage: 800.0 bytes

In [41]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

printing a slice of data frame

In [42]:
df2.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]